export const AboutPageMdContent: string = `
# Подробно о разработчика и автора этого сайта

Привет и спасибо всем тем кто читает эти длинные тексты  и с вашим разрешением я начну свою длииную историю жизни.

Я Абдулхаев Хуршид, Алхамдуллиях мусульманин, человек под ником **Sxnpaii**, рожденный 2005-ом году в городке _Заамин_, расположенный в Джизакском областе Узбекистана. В жизни, как и у всех, у меня тоже были какие-то изменения и трудные времена, и как только освобожден от других жизненных проблем, я пишу это описание и можно говорить пост для блогов,  как всегда когда у меня смена окружения в моём жизни, и когда я закончил 11-ый класс в котором у меня на дороге "стоят" ВУЗы как непроходимая стена, но при этом со своими железными цельями в будущее.


И так я учился в русском классе, в **школе №60**. В 2-ом четверте 10-ого класса начал свою IT обучению в своём городе в учебном IT-центре **[IT-Center Zaamin](https://goo.gl/maps/Bv3L6vNVRYnXATBS6)**. И летом 2022 года продолжил обучение _(и даже можно сказать с нуля)_ в городе Джизак тоже в учебном центре **[Teamit Academy](https://teamit.uz)** и в сентябре того же года вернулся в свой город с ноутбуком. В Заамине благодаря ноутбуку до окончания школы в ИТ-центре Заамина самостоятельно практиковался, и могу вам хвастаться большое количество и сила моих знаний развивался именно в этом периоде. Даже проводил курсы по Фронт-Энду 2-3 месяца с помощью этих знаний. И это всё благодаря всевышнему **Аллаху**. В данный момент (то есть середина лето 2023 года), являюсь учеником академии **[Astrum](https://astrumacademy.uz/)**. И возможно у вас появляется вопрос: "Почему ты учился в нескольких учебных центрах, и даже с нуля ?". Ответ конечно есть, если вам знакомо, есть такое чувство: Пытаемся учиться по своим правилам или же по своим методам, но всё таки будет и было сложно таких кадров найти, в итоге привык к самостоятельному обучению, как говорится по английски "self study". И для вопроса "Почему с нуля ?" могу ответить так: В учебных центрах когда я хотел учится, не были совместимы с моими темами обучения.. Либо не дошли до этого и я не мог в старших группах. Но при этом могу сказать что это будет большой плюс для ваших знаний, это же повторение пройденных.. 

Опыт в реальных проейтах пока что нету, честно говоря у меня нету никакого опыта в командном работе. В самостоятельном образе проекты разработаны с полной силой. Даже можно заметить что проекты со временем "эволюцинируют", если соблюдать внимательно сайты становятся более функциональным и их обьём больше становятся. Но это как вы хотите не будет постоянно Иншааллах. С полной силой стараюсь исправить свои ошибки и работать над ними.


### Стэк в 2023 году:
 **HTML, CSS, Bootstrap, Scss, React, Nextjs, Tailwind, Markdown, Astro** \n и многое другое связанные к веб разработку..
 <br>
 Если всё ещё что-то интересно пожайлуста [свяжитесь](/contact).
  
`;
export const contactsLinks = [
    {
        name: "Телеграм",
        link: "https://t.me/sxnpaii"
    },
    {
        name: "Инстаграм",
        link: "https://instagram.com/the_sxnpaii"
    },
    {
        name: "Гитхаб",
        link: "https://github.com/sxnpaii"
    },
    {
        name: "Телетайп",
        link: "https://teletype.in/@sxnpaii"
    },
    {
        name: "Телеграм",
        link: "https://t.me/sxnpaii_blog"
    },
    {
        name: "Медиум",
        link: "https://medium.com/@sxnpaii"
    },
    {
        name: "Твиттер (Икс)",
        link: "https://twitter.com/the_sxnpaii"
    },
    {
        name: "Dev.to",
        link: "https://dev.to/sxnpaii"
    },
    {
        name: "Daily dev",
        link: "https://app.daily.dev/sxnpaii"
    },
    {
        name: "GitLab",
        link: "https://gitlab.com/sxnpaii"
    }
]

export const RouteLinks = [
    { path: "/", title: "Главная" , isPrivate: false},
    { path: "/posts", title: "Посты", isPrivate: false },
    { path: "/microblog", title: "Микроблог", isPrivate: true },
    { path: "/about", title: "Обо мне", isPrivate: false },
    { path: "/contact", title: "Контакты", isPrivate: false },
    { path: "/tags", title: "Теги", isPrivate: true },
]